/*
    배열 고차 함수
    - 배열의 불변성을 최대한 보장하여 부수효과를 제거한 메서드
    - 각종 배열을 이용하여 자주 사용되는 편리한 기능들을 제공
*/
const array = [7, 11, 20, 1, 8, 3, 16, 2, 19, 9, 10, 4, 13, 12, 14, 17, 15, 5, 18, 6];

/*
    sort(비교 함수) : 
    - 
*/


console.log('==============================');

/*
    forEach(콜백 함수) : 
    - 
    - 
    - 
    - 
*/


console.log('==============================');

/*
    map(콜백 함수) : 
    - 
    - 
*/


console.log('==============================');

/*
    filter(콜백 함수) : 
    - 
    - 
*/


console.log('==============================');

/*
    find(콜백함수) : 
*/


console.log('==============================');

/*
    findIndex(콜백함수) : 
*/


console.log('==============================');